{
  "company": {
    "ticker": "TSLA",
    "name": "Tesla, Inc.",
    "cik": "1318605",
    "fiscal_year_end": "December 31"
  },
  "filing": {
    "type": "10-K",
    "filed_at": "2024-01-29",
    "period_end": "2023-12-31",
    "accession_number": "0001318605-24-000006"
  },
  "debt_section": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\n\nNOTE 10 – DEBT\n\nThe following is a summary of our debt as of December 31, 2023 and 2022 (in millions):\n\n                                                    December 31,\n                                                 2023         2022\nRecourse debt:\n  2.00% Convertible Senior Notes due 2024       $   —        $ 73\n  Automotive Asset-backed Notes                   2,326       2,568\n  Other                                             182         201\n    Total recourse debt                           2,508       2,842\n\nNon-recourse debt:\n  Automotive Lease-backed Notes                   1,283       1,512\n  Solar Asset-backed Notes                          166         239\n  Other                                              51          57\n    Total non-recourse debt                       1,500       1,808\n\n    Total debt                                  $ 4,008     $ 4,650\n\nLess: Debt, current portion                      (2,373)     (1,502)\n    Total debt, excluding current portion       $ 1,635     $ 3,148\n\nAutomotive Asset-backed Notes\n\nWe have issued Automotive Asset-backed Notes under various securitization programs where certain automotive financing receivables secure the notes. As of December 31, 2023, the outstanding principal balance was $2.33 billion with maturity dates ranging from 2024 to 2028 and weighted average interest rates ranging from 1.82% to 6.03%.\n\nAutomotive Lease-backed Notes\n\nWe have issued various Automotive Lease-backed Notes under securitization programs where certain automotive lease receivables secure the notes. As of December 31, 2023, the outstanding principal balance was $1.28 billion with final maturity dates in 2027 and weighted average interest rate of 5.31%.\n\nCredit Agreement\n\nIn August 2023, we entered into an unsecured revolving credit agreement providing for unsecured revolving loans of up to $5.0 billion. As of December 31, 2023, we had no outstanding borrowings under this facility. The credit agreement contains customary covenants, including:\n\n- Maximum Consolidated Total Leverage Ratio of 3.50 to 1.00\n- Minimum Interest Coverage Ratio of 3.00 to 1.00\n\nAs of December 31, 2023, we were in compliance with all covenants. Our Consolidated Total Leverage Ratio was 0.08x and our Interest Coverage Ratio was 48.2x.\n\nDebt Maturities\n\nThe following table presents maturities of our total debt as of December 31, 2023 (in millions):\n\n2024                                            $ 2,373\n2025                                                678\n2026                                                512\n2027                                                389\n2028 and thereafter                                  56\n    Total                                       $ 4,008",
  "earnings_excerpt": "TESLA Q4 2023 EARNINGS CALL TRANSCRIPT\n\nElon Musk, CEO: Thanks for joining us today. We had a strong finish to 2023 with record deliveries in Q4. Looking ahead to 2024, we expect vehicle volume growth may be notably lower than in 2023 as we focus on launching our next generation vehicle.\n\nVaibhav Taneja, CFO: For Q4, revenue was $25.2 billion, up 3% year-over-year. Automotive gross margin was 17.6%, impacted by pricing actions and increased costs. For 2024, we expect CapEx of approximately $10 billion as we continue to invest in our manufacturing capacity.\n\nWe ended the quarter with $29.1 billion in cash and investments, and total debt of $4.0 billion, giving us a very strong balance sheet with net cash of $25.1 billion.\n\nAnalyst (Morgan Stanley): Elon, can you talk about the competitive environment in EVs, especially with pricing pressure from Chinese manufacturers?\n\nElon Musk: Look, we've always said Tesla needs to be competitive on price. We're focused on cost reduction and our next-gen vehicle platform will have significantly lower production costs. Competition is good for the industry."
}
